Тест_ЗУП_31_КОРП/src/Documents/ОперацияУчетаПоСтраховымВзносам/ОперацияУчетаПоСтраховымВзносам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияУчетаПоСтраховымВзносам</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСФондамиПоСтраховымВзносам</registerRecords>
  <registerRecords>AccumulationRegister.ПособияПоСоциальномуСтрахованию</registerRecords>
  <registerRecords>AccumulationRegister.СведенияОДоходахСтраховыеВзносы</registerRecords>
  <registerRecords>AccumulationRegister.ПособияПоУходуЗаРебенком</registerRecords>
  <registerRecords>AccumulationRegister.СтраховыеВзносыПоФизическимЛицам</registerRecords>
  <registerRecords>AccumulationRegister.ИсчисленныеСтраховыеВзносы</registerRecords>
  <attributes>
    <name>МесяцРасчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПФРПоСуммарномуТарифу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРНакопительная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРСтраховая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФФОМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТФОМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФСС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФССНесчастныеСлучаи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРНаДоплатуЛетчикам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРНаДоплатуШахтерам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРПоСуммарномуТарифуЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРСтраховаяЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРНакопительнаяЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФССЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФФОМСЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТФОМСЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПФРДоПредельнойВеличины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРСПревышения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРДоПредельнойВеличиныЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПФРСПревышенияЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СведенияОДоходах</name>
    <attributes>
      <name>ВидДохода</name>
      <type>
        <types>CatalogRef.ВидыДоходовПоСтраховымВзносам</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВидДохода</name>
      <type>
        <types>CatalogRef.УдалитьВидыДоходовПоСтраховымВзносам</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДетей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОблагаетсяЕНВД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОблагаетсяВзносамиНаДоплатуЛетчикам</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОблагаетсяВзносамиНаДоплатуШахтерам</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяДоходомФармацевта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией</name>
      <type>
        <types>EnumRef.ВидыРаботСДосрочнойПенсией</types>
      </type>
    </attributes>
    <attributes>
      <name>КлассУсловийТруда</name>
      <type>
        <types>EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПособияПоСоциальномуСтрахованию</name>
    <attributes>
      <name>ВидПособияСоциальногоСтрахования</name>
      <type>
        <types>EnumRef.ПереченьПособийСоциальногоСтрахования</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСтраховогоСлучая</name>
      <comment>Дата начала болезни, дата рождения ребенка и т.п.</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьКакНовыйСтраховойСлучай</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятости</name>
      <type>
        <types>EnumRef.ВидыЗанятости</types>
      </type>
    </attributes>
    <attributes>
      <name>ОплаченныеДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФинансированиеФедеральнымБюджетом</name>
      <type>
        <types>EnumRef.ОснованияФинансированияПособияФедеральнымБюджетом</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСверхНорм</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПособияПоУходуЗаРебенком</name>
    <attributes>
      <name>НачалоОтпускаПоУходу</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятости</name>
      <type>
        <types>EnumRef.ВидыЗанятости</types>
      </type>
    </attributes>
    <attributes>
      <name>ПособиеПоУходуЗаПервымРебенком</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПособиеПоУходуЗаВторымРебенком</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФинансированиеФедеральнымБюджетом</name>
      <type>
        <types>EnumRef.ОснованияФинансированияПособияФедеральнымБюджетом</types>
      </type>
    </attributes>
    <attributes>
      <name>ПособиеПоУходуЗаПервымРебенкомСверхНорм</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПособиеПоУходуЗаВторымРебенкомСверхНорм</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Documents/ОперацияУчетаПоСтраховымВзносам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		ЗарплатаКадры.ЗаполнитьПоОснованиюСотрудником(ЭтотОбъект, ДанныеЗаполнения, , Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ДанныеДляПроведения = ПолучитьДанныеДляПроведения();
	
	УчетСтраховыхВзносов.СформироватьДоходыСтраховыеВзносы(Движения, Отказ, Организация, МесяцРасчетногоПериода, ДанныеДляПроведения.НачисленияПоСотрудникам, Истина);
	УчетСтраховыхВзносов.СформироватьИсчисленныеВзносы(Движения, Отказ, Организация, МесяцРасчетногоПериода, ДанныеДляПроведения.ВзносыИсчисленные);
	УчетПособийСоциальногоСтрахования.СформироватьПособия(Движения, Отказ, Организация, МесяцРасчетногоПериода, ДанныеДляПроведения.Пособия, ДанныеДляПроведения.ПособияПоУходу);
	УчетСтраховыхВзносов.СформироватьСтраховыеВзносыПоФизическимЛицам(Движения, Отказ, Организация, МесяцРасчетногоПериода, Ссылка, ДанныеДляПроведения.ВзносыИсчисленные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	Возврат ОбменДаннымиЗарплатаКадры.ОграниченияРегистрацииПоОрганизацииИФизическомуЛицу(ЭтотОбъект, Организация, ФизическоеЛицо, МесяцРасчетногоПериода);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеОДоходах.Ссылка.ФизическоеЛицо,
	|	ДанныеОДоходах.ВидДохода,
	|	СУММА(ДанныеОДоходах.Результат) КАК Сумма,
	|	СУММА(ДанныеОДоходах.Скидка) КАК Скидка,
	|	ДанныеОДоходах.ОблагаетсяЕНВД,
	|	ДанныеОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	ДанныеОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	ДанныеОДоходах.ЯвляетсяДоходомФармацевта,
	|	ДанныеОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	ДанныеОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ДанныеОДоходах.КлассУсловийТруда
	|ИЗ
	|	Документ.ОперацияУчетаПоСтраховымВзносам.СведенияОДоходах КАК ДанныеОДоходах
	|ГДЕ
	|	ДанныеОДоходах.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОДоходах.ВидДохода,
	|	ДанныеОДоходах.Ссылка.ФизическоеЛицо,
	|	ДанныеОДоходах.ОблагаетсяЕНВД,
	|	ДанныеОДоходах.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	ДанныеОДоходах.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	ДанныеОДоходах.ЯвляетсяДоходомФармацевта,
	|	ДанныеОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	ДанныеОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ДанныеОДоходах.КлассУсловийТруда
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пособия.ВидПособияСоциальногоСтрахования,
	|	Пособия.Ссылка.ФизическоеЛицо,
	|	Пособия.ВидЗанятости КАК ВидЗанятости,
	|	Пособия.ФинансированиеФедеральнымБюджетом,
	|	ВЫБОР
	|		КОГДА Пособия.УчитыватьКакНовыйСтраховойСлучай
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтраховыеСлучаи,
	|	СУММА(Пособия.ОплаченныеДни) КАК ОплаченныеДни,
	|	СУММА(Пособия.СуммаВсего) КАК СуммаВсего,
	|	СУММА(Пособия.СуммаСверхНорм) КАК СуммаСверхНорм,
	|	Пособия.ДатаСтраховогоСлучая
	|ИЗ
	|	Документ.ОперацияУчетаПоСтраховымВзносам.ПособияПоСоциальномуСтрахованию КАК Пособия
	|ГДЕ
	|	Пособия.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Пособия.Ссылка.ФизическоеЛицо,
	|	Пособия.ДатаСтраховогоСлучая,
	|	Пособия.ВидПособияСоциальногоСтрахования,
	|	Пособия.ФинансированиеФедеральнымБюджетом,
	|	ВЫБОР
	|		КОГДА Пособия.УчитыватьКакНовыйСтраховойСлучай
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	Пособия.ВидЗанятости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пособия.Ссылка.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Пособия.ВидЗанятости КАК ВидЗанятости,
	|	Пособия.ФинансированиеФедеральнымБюджетом КАК ФинансированиеФедеральнымБюджетом,
	|	1 КАК СтраховыеСлучаи,
	|	ВЫБОР
	|		КОГДА Пособия.ПособиеПоУходуЗаПервымРебенком <> 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтраховыеСлучаиПоУходуЗаПервымРебенком,
	|	Пособия.ПособиеПоУходуЗаПервымРебенком КАК СуммаВсегоПоУходуЗаПервымРебенком,
	|	Пособия.ПособиеПоУходуЗаПервымРебенкомСверхНорм КАК СуммаСверхНормПоУходуЗаПервымРебенком,
	|	ВЫБОР
	|		КОГДА Пособия.ПособиеПоУходуЗаВторымРебенком <> 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтраховыеСлучаиПоУходуЗаВторымРебенком,
	|	Пособия.ПособиеПоУходуЗаВторымРебенком КАК СуммаВсегоПоУходуЗаВторымРебенком,
	|	Пособия.ПособиеПоУходуЗаВторымРебенкомСверхНорм КАК СуммаСверхНормПоУходуЗаВторымРебенком,
	|	Пособия.НачалоОтпускаПоУходу КАК ДатаСтраховогоСлучая
	|ИЗ
	|	Документ.ОперацияУчетаПоСтраховымВзносам.ПособияПоУходуЗаРебенком КАК Пособия
	|ГДЕ
	|	Пособия.Ссылка = &Ссылка
	|	И (Пособия.ПособиеПоУходуЗаПервымРебенком <> 0
	|			ИЛИ Пособия.ПособиеПоУходуЗаВторымРебенком <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацияУчетаПоСтраховымВзносам.ФизическоеЛицо
	|ПОМЕСТИТЬ ВТФизическиеЛица
	|ИЗ
	|	Документ.ОперацияУчетаПоСтраховымВзносам КАК ОперацияУчетаПоСтраховымВзносам
	|ГДЕ
	|	ОперацияУчетаПоСтраховымВзносам.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результаты = Запрос.ВыполнитьПакет();
	
	НачисленияПоСотрудникам = Результаты[0].Выгрузить();
	Пособия = Результаты[1].Выгрузить();
	ПособияПоУходу = Результаты[2].Выгрузить();
	
	ДанныеДляПроведения = Новый Структура("НачисленияПоСотрудникам, ВзносыИсчисленные, Пособия, ПособияПоУходу, МенеджерВременныхТаблиц", 
						НачисленияПоСотрудникам,
						УчетСтраховыхВзносов.ДанныеОВзносахИзДокумента(Ссылка, "Документ.ОперацияУчетаПоСтраховымВзносам", , , Ложь, "МесяцРасчетногоПериода"),
						Пособия,
						ПособияПоУходу,
						Запрос.МенеджерВременныхТаблиц);
	
	Возврат ДанныеДляПроведения;

КонецФункции

#КонецОбласти

#КонецЕсли
